In [1]:
import pandas as pd

In [2]:
emp = pd.DataFrame()
print(emp)

Empty DataFrame
Columns: []
Index: []

In [3]:
l = [1,2,3,4]
df = pd.DataFrame(l)
df

   0
0  1
1  2
2  3
3  4

In [10]:
l = [[1,2,3],[4,5,6],[7,8,9]]
df = pd.DataFrame(l)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
d = {'ÍD':[11,22,33]}
df = pd.DataFrame(d)
df

   ÍD
0  11
1  22
2  33

In [6]:
d = [{'a':1},{'b':2},{'c':3}]
df = pd.DataFrame(d)
df

     a    b    c
0  1.0  NaN  NaN
1  NaN  2.0  NaN
2  NaN  NaN  3.0

In [7]:
d = {'ID':[1,2,3],'SN':[4,5,6]}
df = pd.DataFrame(d)
df

   ID  SN
0   1   4
1   2   5
2   3   6

In [8]:
d = [{'id':[1,2]},{'sn':[2,3]}]
df = pd.DataFrame(d)
df

       id      sn
0  [1, 2]     NaN
1     NaN  [2, 3]

In [9]:
d = {'ID':pd.Series([1,2,3]),'SN':pd.Series([2,3,6])}
df = pd.DataFrame(d)
df

   ID  SN
0   1   2
1   2   3
2   3   6